posts/projects/guix-develop.html
title: Development Environments in GNU Guix
date: 2022-05-22 17:40
tags: Guix
recent: t
status: Completed
purpose: Make development with GNU Guix easier.
---

<div id="outline-container-org83f9d0f" class="outline-2">
<h2 id="org83f9d0f">Summary</h2>
<div class="outline-text-2" id="text-org83f9d0f">
<p>
I tried returning to work on Graphdoc earlier this year, but I encountered problems in compiling the program. Building the package through Guix still worked. I thought that having access to the normal Haskell build tools with the security of Guix would be nice. The build systems in Guix already use language specific build tools or their underlying mechanisms, so this should be possible.
</p>

<p>
I recently completed the first version of this program. It works for Haskell
development. Although, it's not using Haskell packages provided by Guix yet, but it's working well enough for me right now. I might also make a video about this program. I think it's pretty nice.
</p>
</div>
</div>

<div id="outline-container-org2915289" class="outline-2">
<h2 id="org2915289">Lessons Learned</h2>
<div class="outline-text-2" id="text-org2915289">
<ul class="org-ul">
<li>Gained a better understanding of GNU Guix code, the store monad, and G-expressions.</li>
<li>Some Haskell build process concepts.</li>
</ul>
</div>
</div>
